Repository: wp-plugins/block-spammers
Catalog: languages/wbs-*.po
Languages: et

source: Block Spammers
et: Spämmijate blokkimine

source: The number of comments this plugin has blocked: <strong>%s</strong>
et: Selle plugina poolt blokitud kommentaaride arv: <strong>%s</strong>

source: General settings
et: Üldseaded

source: Manual blocking
et: Käsitsi blokkimine

source: Block IPs of spam comments
et: Spämm-kommentaaride IPde blokkimine

source: Block bad words
et: Pahade sõnade blokkimine

source: Deleting spam
et: Spämmi kustutamine

source: Merge similar entries
et: Sarnaste kirjete liitmine

source: Message for spammers
et: Sõnum spämmijatele

source: Block IPs
et: IPde blokkimine

source: Bad words
et: Pahad sõnad

source: In this section you can block spammers manually.
et: Selles osas saad spämmijaid käsitsi blokkida.

source: Block comments from IPs that have posted spam before<br />(IPs will be obtained from comments that are marked as spam)
et: Varasemalt spämmi postitanud IPd blokitakse<br />(kasutatakse spämmiks märgitud kommentaaride IP-aadresse)

source: Block comments that contain blacklisted words
et: Pahasid sõnu sisaldavad kommentaarid blokitakse

source: Add IPs of those comments into the blacklist
et: Selliste kommentaaride postitajate IPd lisatakse musta nimekirja

source: When deleting spam, add IPs of spam comments into the blacklist
et: Spämmi kustutamisel lisatakse spämmijate IPd musta nimekirja

source: If %1$s or more IPs have the first %2$s octets matching, then merge them into wildcarded entry
et: Kui %1$s või enama IP esimesed %2$s oktetti on samad, siis liidetakse need IPd metamärgistatud kirjeks

source: Example: 192.168.1.100, 192.168.1.101 and 192.168.2.100 will be merged into 192.168.*.*
et: Näide: 192.168.1.100, 192.168.1.101 ja 192.168.2.100 liidetakse kirjeks 192.168.*.*

source: You are banned from commenting!
et: You are banned from commenting! / Sinu kommentaar on bännitud!

source: Use * for wildcards and start each entry on a new line.<br /><p>Examples:
et: Lisa iga kirje eraldi reale ning metamärgina kasuta *.<br /><p>Näited:

source: This is the same option as
et: Sama asja leiab ka siit:

source: Block spammers from submitting comments, by IPs or by bad words.
et: Tõkestab spämmijatel kommentaaride lisamise IPde või pahade sõnade alusel.
